app/Controllers/RecordController.php

SELECT *
FROM `vendors`
WHERE `status` = 'active'
SELECT *
FROM `stalls`
---
    public function create(): string|object
    {
        $role = $this->getRole();
        if (! in_array($role, ['admin', 'staff'], true)) {
            session()->destroy();
            return redirect()->to(base_url('login'));
        }

        $vendorModel = new VendorModel();
        $stallModel  = new StallModel();

        return view('records/create', [
            'page_title' => 'Add Record',
            'user_name'  => session()->get('user_name'),
            'user_role'  => $role,
            'vendors'    => $vendorModel->where('status', 'active')->findAll(),
            'stalls'     => $stallModel->findAll(),