app/Controllers/StallController.php

SELECT *
FROM `vendors`
WHERE `status` = 'active'
---
    public function create(): string|object
    {
        $guard = $this->requireAdmin();
        if ($guard !== null) return $guard;

        $vendorModel = new VendorModel();
        $vendors     = $vendorModel->where('status', 'active')->findAll();