app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function edit(int $id): string|object
    {
        $guard = $this->requireRoles(['admin']);
        if ($guard !== true) {
            return $guard;
        }

        $user = (new UserModel())->find($id);
        if (! $user) {
            return redirect()->to('/users')->with('error', 'User not found.');