app/Controllers/VendorController.php

    public function create(): string|object
    {
        return view('vendors/create', [
            'page_title' => 'Register Vendor',
            'user_name'  => session()->get('user_name'),
            'user_role'  => session()->get('user_role')
        ]);
---
SELECT *
FROM `vendors`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `vendors`