app/Models/DashboardModel.php

    public function getStaffStats(): array
    {
        return [
            'total_vendors' => $this->countTable('vendors'),
            'total_stalls'  => $this->countTable('stalls'),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `stalls`
SELECT COUNT(*) AS `numrows`
FROM `vendors`