app/Models/PasswordResetModel.php

    public function createToken(string $email, string $token, string $expiresAt): bool
    {
        return $this->insert([
            'email'      => $email,
            'token'      => $token,
            'expires_at' => $expiresAt,
            'used'       => 0,
        ]);
---
INSERT INTO `password_resets` (`email`, `token`, `expires_at`, `used`, `created_at`) VALUES ('admin@wbmm.com', 'de637224711e761d6c5deb53f93b8f44f4711b2aaa51fd12d4aa0f1e556c7e92', '2026-05-04 04:02:07', 0, '2026-05-04 03:02:07')