app/Models/UserModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->select('id, name, email, role')
                    ->where('email', $email)
                    ->first();
---
SELECT `id`, `name`, `email`, `role`
FROM `users`
WHERE `email` = 'admin@wbmm.com'
 LIMIT 1

    public function findByEmailWithPassword(string $email): ?array
    {
        return $this->select('id, name, email, password, role')
                    ->where('email', $email)
                    ->first();
---
SELECT `id`, `name`, `email`, `password`, `role`
FROM `users`
WHERE `email` = 'admin@wbmm.com'
 LIMIT 1